
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_application_insights.appinsights


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "7aac84d3-4afa-4ddd-a7aa-b39eabb0d02b" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Insights/components/dtsse-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "dtsse-appinsights-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git" -> null
            "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "DTS Software Engineering"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY will be updated in-place
  ~ resource "azurerm_key_vault_secret" "AZURE_APPINSIGHTS_KEY" {
        id                      = "https://dtsse-aat.vault.azure.net/secrets/AppInsightsConnectionString/71c8fa27083c402992a91417296dd569"
        name                    = "AppInsightsConnectionString"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat|dtsse-aat"
        name                       = "dtsse-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":70,"Program":"tfcmt","SHA1":"","Vars":{}} -->